In [2]:
import os
print(os.getcwd())
os.chdir('d:\\vscode_machineLearning\\internship\\Customer-Churn-Prediction')
print(os.getcwd())

d:\vscode_machineLearning\internship\Customer-Churn-Prediction\experiments\EDA
d:\vscode_machineLearning\internship\Customer-Churn-Prediction

In [3]:
import pandas as pd
from ensure import ensure_annotations
import numpy as np

In [6]:
df = pd.read_excel(r'artifacts\raw_data\customer_churn_large_dataset.xlsx')

In [7]:
@ensure_annotations
def random_values(feature_name,total=6):
    for i in range(0,total):
        index = np.random.randint(df.shape[0])
        print(index,':',df[feature_name].iloc[index])

In [8]:
df

,CustomerID,Name,Age,Gender,Location,Subscription_Length_Months,Monthly_Bill,Total_Usage_GB,Churn
0,1,Customer_1,63,Male,Los Angeles,17,73.36,236,0
1,2,Customer_2,62,Female,New York,1,48.76,172,0
2,3,Customer_3,24,Female,Los Angeles,5,85.47,460,0
3,4,Customer_4,36,Female,Miami,3,97.94,297,1
4,5,Customer_5,46,Female,Miami,19,58.14,266,0
...,...,...,...,...,...,...,...,...,...
99995,99996,Customer_99996,33,Male,Houston,23,55.13,226,1
99996,99997,Customer_99997,62,Female,New York,19,61.65,351,0
99997,99998,Customer_99998,64,Male,Chicago,17,96.11,251,1
99998,99999,Customer_99999,51,Female,New York,20,49.25,434,1
99999,100000,Customer_100000,27,Female,Los Angeles,19,76.57,173,1

## Name and CustomerID

In [9]:
random_values('CustomerID')

23378 : 23379
41602 : 41603
53252 : 53253
98994 : 98995
52904 : 52905
62087 : 62088

In [10]:
random_values('Name')

56412 : Customer_56413
71938 : Customer_71939
3679 : Customer_3680
26847 : Customer_26848
74727 : Customer_74728
34854 : Customer_34855

In [11]:
print(df['CustomerID'].nunique())
print(df['Name'].nunique()) # same to rows of the dataset. Dropping would be best option

100000
100000

In [12]:
df.isnull().sum()

CustomerID                    0
Name                          0
Age                           0
Gender                        0
Location                      0
Subscription_Length_Months    0
Monthly_Bill                  0
Total_Usage_GB                0
Churn                         0
dtype: int64

In [13]:
df.to_csv(r'artifacts/customer_churn_removed_col.csv',index=False)

## AwesomeðŸ¤©ðŸ¤© no null values are there

### Dropping `CustomerID` and `Name`

In [14]:
df = df.drop(columns=['CustomerID','Name'])

In [15]:
df

,Age,Gender,Location,Subscription_Length_Months,Monthly_Bill,Total_Usage_GB,Churn
0,63,Male,Los Angeles,17,73.36,236,0
1,62,Female,New York,1,48.76,172,0
2,24,Female,Los Angeles,5,85.47,460,0
3,36,Female,Miami,3,97.94,297,1
4,46,Female,Miami,19,58.14,266,0
...,...,...,...,...,...,...,...
99995,33,Male,Houston,23,55.13,226,1
99996,62,Female,New York,19,61.65,351,0
99997,64,Male,Chicago,17,96.11,251,1
99998,51,Female,New York,20,49.25,434,1
99999,27,Female,Los Angeles,19,76.57,173,1

### description

In [16]:
df.describe()

,Age,Subscription_Length_Months,Monthly_Bill,Total_Usage_GB,Churn
count,100000.000000,100000.000000,100000.000000,100000.000000,100000.000000
mean,44.027020,12.490100,65.053197,274.393650,0.497790
std,15.280283,6.926461,20.230696,130.463063,0.499998
min,18.000000,1.000000,30.000000,50.000000,0.000000
25%,31.000000,6.000000,47.540000,161.000000,0.000000
50%,44.000000,12.000000,65.010000,274.000000,0.000000
75%,57.000000,19.000000,82.640000,387.000000,1.000000
max,70.000000,24.000000,100.000000,500.000000,1.000000

### dtypes

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 7 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   Age                         100000 non-null  int64
 1   Gender                      100000 non-null  object
 2   Location                    100000 non-null  object
 3   Subscription_Length_Months  100000 non-null  int64
 4   Monthly_Bill                100000 non-null  float64
 5   Total_Usage_GB              100000 non-null  int64
 6   Churn                       100000 non-null  int64
dtypes: float64(1), int64(4), object(2)
memory usage: 5.3+ MB

## Location

In [18]:
df['Location'].value_counts()

Location
Houston        20157
Los Angeles    20041
Miami          20031
Chicago        19958
New York       19813
Name: count, dtype: int64